dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMsc_bf.h
/** \brief Length for Ifx_MSC_DSC_Bits.TM */
#define IFX_MSC_DSC_TM_LEN (1u)

/** \brief Mask for Ifx_MSC_DSC_Bits.TM */
#define IFX_MSC_DSC_TM_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSC_Bits.TM */
#define IFX_MSC_DSC_TM_OFF (0u)

/** \brief Length for Ifx_MSC_DSC_Bits.CP */
#define IFX_MSC_DSC_CP_LEN (1u)

/** \brief Mask for Ifx_MSC_DSC_Bits.CP */
#define IFX_MSC_DSC_CP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSC_Bits.CP */
#define IFX_MSC_DSC_CP_OFF (1u)

/** \brief Length for Ifx_MSC_DSC_Bits.DP */
#define IFX_MSC_DSC_DP_LEN (1u)

/** \brief Mask for Ifx_MSC_DSC_Bits.DP */
#define IFX_MSC_DSC_DP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSC_Bits.DP */
#define IFX_MSC_DSC_DP_OFF (2u)

/** \brief Length for Ifx_MSC_DSC_Bits.NDBL */
#define IFX_MSC_DSC_NDBL_LEN (5u)

/** \brief Mask for Ifx_MSC_DSC_Bits.NDBL */
#define IFX_MSC_DSC_NDBL_MSK (0x1fu)

/** \brief Offset for Ifx_MSC_DSC_Bits.NDBL */
#define IFX_MSC_DSC_NDBL_OFF (3u)

/** \brief Length for Ifx_MSC_DSC_Bits.NDBH */
#define IFX_MSC_DSC_NDBH_LEN (5u)

/** \brief Mask for Ifx_MSC_DSC_Bits.NDBH */
#define IFX_MSC_DSC_NDBH_MSK (0x1fu)

/** \brief Offset for Ifx_MSC_DSC_Bits.NDBH */
#define IFX_MSC_DSC_NDBH_OFF (8u)

/** \brief Length for Ifx_MSC_DSC_Bits.ENSELL */
#define IFX_MSC_DSC_ENSELL_LEN (1u)

/** \brief Mask for Ifx_MSC_DSC_Bits.ENSELL */
#define IFX_MSC_DSC_ENSELL_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSC_Bits.ENSELL */
#define IFX_MSC_DSC_ENSELL_OFF (13u)

/** \brief Length for Ifx_MSC_DSC_Bits.ENSELH */
#define IFX_MSC_DSC_ENSELH_LEN (1u)

/** \brief Mask for Ifx_MSC_DSC_Bits.ENSELH */
#define IFX_MSC_DSC_ENSELH_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSC_Bits.ENSELH */
#define IFX_MSC_DSC_ENSELH_OFF (14u)

/** \brief Length for Ifx_MSC_DSC_Bits.DSDIS */
#define IFX_MSC_DSC_DSDIS_LEN (1u)

/** \brief Mask for Ifx_MSC_DSC_Bits.DSDIS */
#define IFX_MSC_DSC_DSDIS_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSC_Bits.DSDIS */
#define IFX_MSC_DSC_DSDIS_OFF (15u)

/** \brief Length for Ifx_MSC_DSC_Bits.NBC */
#define IFX_MSC_DSC_NBC_LEN (6u)

/** \brief Mask for Ifx_MSC_DSC_Bits.NBC */
#define IFX_MSC_DSC_NBC_MSK (0x3fu)

/** \brief Offset for Ifx_MSC_DSC_Bits.NBC */
#define IFX_MSC_DSC_NBC_OFF (16u)

/** \brief Length for Ifx_MSC_DSC_Bits.PPD */
#define IFX_MSC_DSC_PPD_LEN (5u)

/** \brief Mask for Ifx_MSC_DSC_Bits.PPD */
#define IFX_MSC_DSC_PPD_MSK (0x1fu)

/** \brief Offset for Ifx_MSC_DSC_Bits.PPD */
#define IFX_MSC_DSC_PPD_OFF (24u)

/** \brief Length for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_LEN (4u)

/** \brief Mask for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_MSK (0xfu)

/** \brief Offset for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_OFF (0u)

/** \brief Length for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_LEN (4u)

/** \brief Mask for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_MSK (0xfu)

/** \brief Offset for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_OFF (8u)

/** \brief Length for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_LEN (8u)

/** \brief Mask for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_MSK (0xffu)

/** \brief Offset for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_OFF (16u)

/** \brief Length for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_LEN (1u)

/** \brief Mask for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_OFF (24u)

/** \brief Length for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_LEN (1u)

/** \brief Mask for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_OFF (25u)

/** \brief Length for Ifx_MSC_DD_Bits.DDL */
#define IFX_MSC_DD_DDL_LEN (16u)

/** \brief Mask for Ifx_MSC_DD_Bits.DDL */
#define IFX_MSC_DD_DDL_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DD_Bits.DDL */
#define IFX_MSC_DD_DDL_OFF (0u)

/** \brief Length for Ifx_MSC_DD_Bits.DDH */
#define IFX_MSC_DD_DDH_LEN (16u)

/** \brief Mask for Ifx_MSC_DD_Bits.DDH */
#define IFX_MSC_DD_DDH_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DD_Bits.DDH */
#define IFX_MSC_DD_DDH_OFF (16u)

/** \brief Length for Ifx_MSC_DC_Bits.DCL */
#define IFX_MSC_DC_DCL_LEN (16u)

/** \brief Mask for Ifx_MSC_DC_Bits.DCL */
#define IFX_MSC_DC_DCL_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DC_Bits.DCL */
#define IFX_MSC_DC_DCL_OFF (0u)

/** \brief Length for Ifx_MSC_DC_Bits.DCH */
#define IFX_MSC_DC_DCH_LEN (16u)

/** \brief Mask for Ifx_MSC_DC_Bits.DCH */
#define IFX_MSC_DC_DCH_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DC_Bits.DCH */
#define IFX_MSC_DC_DCH_OFF (16u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_OFF (0u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_OFF (2u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_OFF (4u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_OFF (6u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_OFF (8u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_MSK (0x3u)

