dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMsc_bf.h
/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_OFF (10u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_OFF (12u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_OFF (14u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_OFF (16u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_OFF (18u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_OFF (20u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_OFF (22u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL12 */
#define IFX_MSC_DSDSL_SL12_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL12 */
#define IFX_MSC_DSDSL_SL12_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL12 */
#define IFX_MSC_DSDSL_SL12_OFF (24u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL13 */
#define IFX_MSC_DSDSL_SL13_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL13 */
#define IFX_MSC_DSDSL_SL13_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL13 */
#define IFX_MSC_DSDSL_SL13_OFF (26u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL14 */
#define IFX_MSC_DSDSL_SL14_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL14 */
#define IFX_MSC_DSDSL_SL14_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL14 */
#define IFX_MSC_DSDSL_SL14_OFF (28u)

/** \brief Length for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_OFF (30u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH0 */
#define IFX_MSC_DSDSH_SH0_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH0 */
#define IFX_MSC_DSDSH_SH0_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH0 */
#define IFX_MSC_DSDSH_SH0_OFF (0u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH1 */
#define IFX_MSC_DSDSH_SH1_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH1 */
#define IFX_MSC_DSDSH_SH1_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH1 */
#define IFX_MSC_DSDSH_SH1_OFF (2u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH2 */
#define IFX_MSC_DSDSH_SH2_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH2 */
#define IFX_MSC_DSDSH_SH2_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH2 */
#define IFX_MSC_DSDSH_SH2_OFF (4u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH3 */
#define IFX_MSC_DSDSH_SH3_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH3 */
#define IFX_MSC_DSDSH_SH3_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH3 */
#define IFX_MSC_DSDSH_SH3_OFF (6u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH4 */
#define IFX_MSC_DSDSH_SH4_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH4 */
#define IFX_MSC_DSDSH_SH4_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH4 */
#define IFX_MSC_DSDSH_SH4_OFF (8u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH5 */
#define IFX_MSC_DSDSH_SH5_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH5 */
#define IFX_MSC_DSDSH_SH5_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH5 */
#define IFX_MSC_DSDSH_SH5_OFF (10u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_OFF (12u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_OFF (14u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_OFF (16u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_OFF (18u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH10 */
#define IFX_MSC_DSDSH_SH10_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH10 */
#define IFX_MSC_DSDSH_SH10_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH10 */
#define IFX_MSC_DSDSH_SH10_OFF (20u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH11 */
#define IFX_MSC_DSDSH_SH11_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH11 */
#define IFX_MSC_DSDSH_SH11_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH11 */
#define IFX_MSC_DSDSH_SH11_OFF (22u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH12 */
#define IFX_MSC_DSDSH_SH12_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH12 */
#define IFX_MSC_DSDSH_SH12_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH12 */
#define IFX_MSC_DSDSH_SH12_OFF (24u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH13 */
#define IFX_MSC_DSDSH_SH13_LEN (2u)

/** \brief Mask for Ifx_MSC_DSDSH_Bits.SH13 */
#define IFX_MSC_DSDSH_SH13_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSDSH_Bits.SH13 */
#define IFX_MSC_DSDSH_SH13_OFF (26u)

/** \brief Length for Ifx_MSC_DSDSH_Bits.SH14 */
#define IFX_MSC_DSDSH_SH14_LEN (2u)

