dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMsc_bf.h
/** \brief Length for Ifx_MSC_ESRE_Bits.ENH21 */
#define IFX_MSC_ESRE_ENH21_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH21 */
#define IFX_MSC_ESRE_ENH21_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH21 */
#define IFX_MSC_ESRE_ENH21_OFF (21u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH22 */
#define IFX_MSC_ESRE_ENH22_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH22 */
#define IFX_MSC_ESRE_ENH22_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH22 */
#define IFX_MSC_ESRE_ENH22_OFF (22u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH23 */
#define IFX_MSC_ESRE_ENH23_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH23 */
#define IFX_MSC_ESRE_ENH23_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH23 */
#define IFX_MSC_ESRE_ENH23_OFF (23u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH24 */
#define IFX_MSC_ESRE_ENH24_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH24 */
#define IFX_MSC_ESRE_ENH24_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH24 */
#define IFX_MSC_ESRE_ENH24_OFF (24u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH25 */
#define IFX_MSC_ESRE_ENH25_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH25 */
#define IFX_MSC_ESRE_ENH25_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH25 */
#define IFX_MSC_ESRE_ENH25_OFF (25u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH26 */
#define IFX_MSC_ESRE_ENH26_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH26 */
#define IFX_MSC_ESRE_ENH26_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH26 */
#define IFX_MSC_ESRE_ENH26_OFF (26u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH27 */
#define IFX_MSC_ESRE_ENH27_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH27 */
#define IFX_MSC_ESRE_ENH27_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH27 */
#define IFX_MSC_ESRE_ENH27_OFF (27u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH28 */
#define IFX_MSC_ESRE_ENH28_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH28 */
#define IFX_MSC_ESRE_ENH28_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH28 */
#define IFX_MSC_ESRE_ENH28_OFF (28u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH29 */
#define IFX_MSC_ESRE_ENH29_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH29 */
#define IFX_MSC_ESRE_ENH29_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH29 */
#define IFX_MSC_ESRE_ENH29_OFF (29u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH30 */
#define IFX_MSC_ESRE_ENH30_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH30 */
#define IFX_MSC_ESRE_ENH30_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH30 */
#define IFX_MSC_ESRE_ENH30_OFF (30u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH31 */
#define IFX_MSC_ESRE_ENH31_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH31 */
#define IFX_MSC_ESRE_ENH31_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH31 */
#define IFX_MSC_ESRE_ENH31_OFF (31u)

/** \brief Length for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_LEN (2u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_OFF (0u)

/** \brief Length for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_LEN (6u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_MSK (0x3fu)

/** \brief Offset for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_OFF (2u)

/** \brief Length for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_LEN (4u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_MSK (0xfu)

/** \brief Offset for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_OFF (8u)

/** \brief Length for Ifx_MSC_DSTE_Bits.PPCEM */
#define IFX_MSC_DSTE_PPCEM_LEN (1u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.PPCEM */
#define IFX_MSC_DSTE_PPCEM_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.PPCEM */
#define IFX_MSC_DSTE_PPCEM_OFF (12u)

/** \brief Length for Ifx_MSC_DSTE_Bits.FM */
#define IFX_MSC_DSTE_FM_LEN (1u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.FM */
#define IFX_MSC_DSTE_FM_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.FM */
#define IFX_MSC_DSTE_FM_OFF (16u)

/** \brief Length for Ifx_MSC_DSTE_Bits.CX */
#define IFX_MSC_DSTE_CX_LEN (1u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.CX */
#define IFX_MSC_DSTE_CX_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.CX */
#define IFX_MSC_DSTE_CX_OFF (28u)

/** \brief Length for Ifx_MSC_DSTE_Bits.UL1 */
#define IFX_MSC_DSTE_UL1_LEN (1u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.UL1 */
#define IFX_MSC_DSTE_UL1_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.UL1 */
#define IFX_MSC_DSTE_UL1_OFF (31u)

/** \brief Length for Ifx_MSC_DDM_Bits.DDLM */
#define IFX_MSC_DDM_DDLM_LEN (16u)

/** \brief Mask for Ifx_MSC_DDM_Bits.DDLM */
#define IFX_MSC_DDM_DDLM_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DDM_Bits.DDLM */
#define IFX_MSC_DDM_DDLM_OFF (0u)

/** \brief Length for Ifx_MSC_DDM_Bits.DDHM */
#define IFX_MSC_DDM_DDHM_LEN (16u)

/** \brief Mask for Ifx_MSC_DDM_Bits.DDHM */
#define IFX_MSC_DDM_DDHM_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DDM_Bits.DDHM */
#define IFX_MSC_DDM_DDHM_OFF (16u)

/** \brief Length for Ifx_MSC_DDE_Bits.DDLE */
#define IFX_MSC_DDE_DDLE_LEN (16u)

/** \brief Mask for Ifx_MSC_DDE_Bits.DDLE */
#define IFX_MSC_DDE_DDLE_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DDE_Bits.DDLE */
#define IFX_MSC_DDE_DDLE_OFF (0u)

/** \brief Length for Ifx_MSC_DDE_Bits.DDHE */
#define IFX_MSC_DDE_DDHE_LEN (16u)

/** \brief Mask for Ifx_MSC_DDE_Bits.DDHE */
#define IFX_MSC_DDE_DDHE_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DDE_Bits.DDHE */
#define IFX_MSC_DDE_DDHE_OFF (16u)

/** \brief Length for Ifx_MSC_DCM_Bits.DCLM */
#define IFX_MSC_DCM_DCLM_LEN (16u)

/** \brief Mask for Ifx_MSC_DCM_Bits.DCLM */
#define IFX_MSC_DCM_DCLM_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DCM_Bits.DCLM */
#define IFX_MSC_DCM_DCLM_OFF (0u)

/** \brief Length for Ifx_MSC_DCM_Bits.DCHM */
#define IFX_MSC_DCM_DCHM_LEN (16u)

/** \brief Mask for Ifx_MSC_DCM_Bits.DCHM */
#define IFX_MSC_DCM_DCHM_MSK (0xffffu)

